Revit 2027 API
BaseExportOptions.SetExportLayerTable Method
 Sets layer table back to option
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetExportLayerTable(
	ExportLayerTable layerTable
)
Public Sub SetExportLayerTable (
	layerTable As ExportLayerTable
)
public:
void SetExportLayerTable(
	ExportLayerTable^ layerTable
)
member SetExportLayerTable :
        layerTable : ExportLayerTable -> unit
Parameters
layerTable ExportLayerTable
 The layer table to be set
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace